[Killed] BlockStatement
modules/organization/services/register.service.ts:9:37
 export class RegisterOrganizationService {
 	constructor(private organizationRepository: OrganizationRepository) {}
 
-	async execute(params: RegisterDTO) {
-		const checkIfExists =
-			await this.organizationRepository.findOrganizationByEmail(params.email)
-
-		if (checkIfExists) {
-			throw new OrganizationAlreadyExistsError()
-		}
-
-		const hashedPassword = await bcrypt.hash(params.password, 6)
-		const organization = await this.organizationRepository.registerOrganization(
-			{
-				...params,
-				password: hashedPassword
-			}
-		)
-
-		return {
-			organization
-		}
-	}
+	async execute(params: RegisterDTO) {}
 }
 
killedBy: Register Organization should register an organization
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
modules/organization/services/register.service.ts:13:7
 		const checkIfExists =
 			await this.organizationRepository.findOrganizationByEmail(params.email)
 
-		if (checkIfExists) {
+		if (false) {
 			throw new OrganizationAlreadyExistsError()
 		}
killedBy: Register Organization should not register an organization with an existing email
statusReason: promise resolved "{ organization: { …(7) } }" instead of rejecting

[Killed] BlockStatement
modules/organization/services/register.service.ts:13:22
 		const checkIfExists =
 			await this.organizationRepository.findOrganizationByEmail(params.email)
 
-		if (checkIfExists) {
-			throw new OrganizationAlreadyExistsError()
-		}
+		if (checkIfExists) {}
 
 		const hashedPassword = await bcrypt.hash(params.password, 6)
killedBy: Register Organization should not register an organization with an existing email
statusReason: promise resolved "{ organization: { …(7) } }" instead of rejecting
