[Killed] BlockStatement
modules/organization/services/session.service.ts:9:36
 export class SessionOrganizationService {
 	constructor(private organizationRepository: OrganizationRepository) {}
 
-	async execute(params: SessionDTO) {
-		const user =
-			await this.organizationRepository.findOrganizationByEmailWithCredentials(
-				params.email
-			)
-
-		if (!user) {
-			throw new InvalidCredentialsError()
-		}
-
-		const doesPasswordMatch = await bcrypt.compare(
-			params.password,
-			user.password
-		)
-
-		if (!doesPasswordMatch) {
-			throw new InvalidCredentialsError()
-		}
-
-		const { password, ...safeUser } = user
-
-		return safeUser
-	}
+	async execute(params: SessionDTO) {}
 }
 
killedBy: Session Organization should create a session for an organization
statusReason: expected undefined to be truthy

[Killed] BooleanLiteral
modules/organization/services/session.service.ts:24:7
 			user.password
 		)
 
-		if (!doesPasswordMatch) {
+		if (doesPasswordMatch) {
 			throw new InvalidCredentialsError()
 		}
killedBy: Session Organization should create a session for an organization
statusReason: Invalid credentials

[Killed] ConditionalExpression
modules/organization/services/session.service.ts:24:7
 			user.password
 		)
 
-		if (!doesPasswordMatch) {
+		if (true) {
 			throw new InvalidCredentialsError()
 		}
killedBy: Session Organization should create a session for an organization
statusReason: Invalid credentials
