[Killed] BlockStatement
modules/pets/services/register.service.ts:7:67
 export class RegisterPetService {
 	constructor(private petsRepository: PetsRepository) {}
 
-	async execute(data: RegisterPetDTO & { organizationId: string }) {
-		const pet = await this.petsRepository.create(data)
-
-		return pet
-	}
+	async execute(data: RegisterPetDTO & { organizationId: string }) {}
 }
 
killedBy: Register Pet should register a pet
statusReason: expected [] to have a length of 1 but got +0
