[Killed] BlockStatement
modules/pets/services/get-by-id.service.ts:7:28
 export class GetByIdPetsService {
 	constructor(private petsRepository: PetsRepository) {}
 
-	async execute(id: string) {
-		const pet = await this.petsRepository.findById(id)
-
-		if (!pet) {
-			throw new PetNotFoundError()
-		}
-
-		return pet
-	}
+	async execute(id: string) {}
 }
 
killedBy: Get Pet By Id should return a pet by id
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
modules/pets/services/get-by-id.service.ts:10:7
 	async execute(id: string) {
 		const pet = await this.petsRepository.findById(id)
 
-		if (!pet) {
+		if (true) {
 			throw new PetNotFoundError()
 		}
killedBy: Get Pet By Id should return a pet by id
statusReason: Pet not found

[Killed] BooleanLiteral
modules/pets/services/get-by-id.service.ts:10:7
 	async execute(id: string) {
 		const pet = await this.petsRepository.findById(id)
 
-		if (!pet) {
+		if (pet) {
 			throw new PetNotFoundError()
 		}
killedBy: Get Pet By Id should return a pet by id
statusReason: Pet not found
