[Killed] BlockStatement
modules/pets/services/list.service.ts:7:40
 export class ListPetsService {
 	constructor(private petsRepository: PetsRepository) {}
 
-	async execute(filters: FilterPetsDTO) {
-		const pet = await this.petsRepository.findManyByFilters(filters)
-
-		return pet
-	}
+	async execute(filters: FilterPetsDTO) {}
 }
 
killedBy: List Pets should return all pets from a city
statusReason: Target cannot be null or undefined.
